src/test/resources/com/github/jcustenborder/kafka/connect/json/invoice.data.json

{
  "public_service_provider_id": "2060",
  "public_service_provider": "NHSZ TAPOLCA NONPROFIT KORLÁTOLT FELELŐSSÉGŰ TÁRSASÁG                                                                                                 ",
  "tsz_invoice_id": 48976252,
  "tsz_invoice_nr": 123200693,
  "tsz_original_invoice_nr": 123200693,
  "inv_fullfilment_date": "2019-08-29",
  "inv_date": "2019-10-15",
  "inv_duedate": "2019-10-30",
  "inv_reckoning_datefrom": "2019-04-01",
  "inv_reckoning_dateto": "2019-06-30",
  "inv_billing_cycle": 201906,
  "tsz_cust_id": 15760511,
  "tsz_bill_collector_id": 15915928,
  "inv_cust_name": "Xxxx Xxxxxxxx Xxxxxx                                                                                                    ",
  "inv_invoice_name": "Xxxx Xxxxxxxx Xxxxxx                                                            ",
  "inv_zip": "CH8180   ",
  "inv_city": "Bülach                                  ",
  "inv_address": "Spitalstrasse  12                       ",
  "inv_tax_nr": "                    ",
  "inv_group_tax_nr": "                    ",
  "inv_nav_online_flag": "0",
  "inv_bank_account_nr": null,
  "inv_net_amount": 4719,
  "inv_vat": 1274,
  "inv_gross_amount": 5993,
  "inv_amount_currency": "HUF",
  "inv_allocated_amount_from_overpayment": 0,
  "inv_amount_of_support": 0,
  "inv_payable_amount": 5993,
  "inv_cheque_amount": 5993,
  "inv_cheque_payment_id": "012345678901234567890123",
  "inv_original_balance": 0,
  "inv_original_balance_date": "2019-10-10",
  "inv_previous_balance": 0,
  "inv_actual_balance": 5993,
  "tsz_place_of_service_id": 31552919,
  "inv_place_of_service_country": "HU        ",
  "inv_place_of_service_zip": "8330     ",
  "inv_place_of_service_city": "Sümeg                                   ",
  "inv_place_of_service_address": "Vadrózsa utca  4                                                                ",
  "tsz_service_user_id": 15696465,
  "inv_service_user_country": "HU        ",
  "inv_service_user_zip": "8330     ",
  "inv_service_user_city": "Sümeg                                   ",
  "inv_service_user_address": "Vadrózsa utca utca 4                                                            ",
  "inv_service_user_name": "Xxxx Xxxxxxxx Xxxxxx                                                                                                    ",
  "inv_service_user_type": "Természetes személy                                         ",
  "inv_overhead_reduction_flag": "0",
  "inv_format_type": "Csekkes                                 ",
  "inv_overhead_reduction_gross": 666,
  "inv_overhead_reduction_akt_gross": 666,
  "inv_sconto_discount_percent": 0,
  "inv_sconto_duedate": "2999-12-31",
  "inv_sconto_discount_gross": 0,
  "inv_payment_type": "Csekkes                                 ",
  "inv_payment_term_days": "15 ",
  "inv_cust_country": "HU        ",
  "inv_cust_zip": "8330     ",
  "inv_cust_city": "Sümeg                                   ",
  "inv_cust_address": "Vadrózsa utca  4                                                                ",
  "inv_postal_country": "HU        ",
  "inv_postal_zip": "CH8180   ",
  "inv_postal_city": "Bülach                                  ",
  "inv_postal_address": "Spitalstrasse  12                                                               ",
  "inv_type": "Sztornózott számla                      ",
  "inv_status": "Számla feladva                          ",
  "tsz_replacement_document_id": null,
  "repdoc_tax_nr": null,
  "repdoc_group_tax_nr": null,
  "repdoc_foreign_tax_nr_eu": null,
  "repdoc_foreign_tax_nr": null,
  "repdoc_invoice_name": null,
  "repdoc_invoice_zip": null,
  "repdoc_invoice_city": null,
  "repdoc_invoice_address": null,
  "repdoc_cust_name": null,
  "repdoc_cust_country": null,
  "repdoc_cust_zip": null,
  "repdoc_cust_city": null,
  "repdoc_cust_address": null,
  "repdoc_zip": null,
  "repdoc_city": null,
  "repdoc_address": null,
  "repdoc_place_of_service_zip": null,
  "repdoc_place_of_service_city": null,
  "repdoc_place_of_service_address": null,
  "repdoc_service_user_name": null,
  "repdoc_payment_type": null,
  "repdoc_previous_balance": null,
  "repdoc_overhead_reduction_gross": null,
  "repdoc_date": null,
  "repdoc_duedate": null,
  "repdoc_financial_settle": null,
  "repdoc_date_change": null,
  "repdoc_invoice_info": null,
  "repdoc_tax_nr_new": null,
  "repdoc_group_tax_nr_new": null,
  "repdoc_foreign_tax_nr_eu_new": null,
  "repdoc_foreign_tax_nr_new": null,
  "repdoc_invoice_name_new": null,
  "repdoc_invoice_zip_new": null,
  "repdoc_invoice_city_new": null,
  "repdoc_invoice_address_new": null,
  "repdoc_cust_name_new": null,
  "repdoc_cust_country_new": null,
  "repdoc_cust_zip_new": null,
  "repdoc_cust_city_new": null,
  "repdoc_cust_address_new": null,
  "repdoc_zip_new": null,
  "repdoc_city_new": null,
  "repdoc_address_new": null,
  "repdoc_place_of_service_zip_new": null,
  "repdoc_place_of_service_city_new": null,
  "repdoc_place_of_service_address_new": null,
  "repdoc_service_user_name_new": null,
  "repdoc_payment_type_new": null,
  "repdoc_previous_balance_new": null,
  "repdoc_overhead_reduction_gross_new": null,
  "repdoc_date_new": null,
  "repdoc_duedate_new": null,
  "repdoc_financial_settle_new": null,
  "repdoc_date_change_new": null,
  "repdoc_invoice_info_new": null,
  "repdoc_note": null,
  "inv_einvoice_email": null,
  "inv_dijnet_id": null,
  "tsz_original_invoice_id": null,
  "tsz_referred_invoice_id": null,
  "inv_international_tax_nr_eu": null,
  "inv_international_tax_nr": null,
  "tsz_fee_service_id": 26713323,
  "invfee_term_datefrom": "2019-05-01",
  "invfee_term_dateto": "2019-05-31",
  "invfee_reckoning_datefrom": "2019-05-01",
  "invfee_reckoning_dateto": "2019-05-31",
  "invfee_quantity": 1,
  "invfee_unit_of_measure": "Hónap                                                       ",
  "invfee_overhead_reduction_flag": "1",
  "invfee_unit_price": 1573,
  "invfee_rate": 1,
  "invfee_unit_of_measure_fixed": "Hónap                                                       ",
  "invfee_overhead_reduction_rate": 100,
  "invfee_net": 1573,
  "invfee_vat": 424.71,
  "invfee_gross": 1997.71,
  "invfee_priced_liters": 519.6,
  "invfee_net_without_oreduction": 1747.78,
  "invfee_vat_without_oreduction": 471.9,
  "invfee_gross_without_oreduction": 2219.68,
  "invfee_overhead_reduction_net": 174.78,
  "invfee_overhead_reduction_vat": 47.19,
  "invfee_overhead_reduction_gross": 221.97,
  "invothercharge_type": null,
  "tsz_othercharge_service_id": null,
  "invothercharge_term_datefrom": null,
  "invothercharge_term_dateto": null,
  "invothercharge_reckoning_datefrom": null,
  "invothercharge_reckoning_dateto": null,
  "invothercharge_quantity": null,
  "invothercharge_unit_of_measure": null,
  "invothercharge_overhead_reduction_flag": null,
  "invothercharge_unit_price": null,
  "invothercharge_rate": null,
  "invothercharge_unit_of_measure_fixed": null,
  "invothercharge_overhead_reduction_rate": null,
  "invothercharge_net": null,
  "invothercharge_vat": null,
  "invothercharge_gross": null,
  "invothercharge_priced_liters": null,
  "invothercharge_net_without_oreduction": null,
  "invothercharge_vat_without_oreduction": null,
  "invothercharge_gross_without_oreduction": null,
  "invothercharge_vat_type": null,
  "invothercharge_brutto_type": null,
  "invothercharge_overhead_reduction_net": null,
  "invothercharge_overhead_reduction_vat": null,
  "invothercharge_overhead_reduction_gross": null,
  "invfee_fee_record_number": 3,
  "public_service_int_provider_id": 2490,
  "public_service_int_provider_name": "xxxxxxxxxxxxxxxxxx                                                                                                                                    ",
  "batch_id": "2022/07/25 09:51:57.861"
}
